import { useEffect } from "react";
import React from "react";

export const Policy: React.FC = () => {
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);
  return (
    <main>
      <div className="container my-4">
        <div className="row d-flex justify-content-center">
          <div className="col-md-8">
            <div className="alert alert-danger fixed-alert mb-1 text-center">
              <p>
                Этот текст скопирован с веб-сайта{" "}
                <a
                  className="alert-link"
                  href="https://sushi-pizzi.ru/kirov/documents/privacy-policy"
                  target="_blank"
                  rel="noopener noreferrer"
                >
                  https://sushi-pizzi.ru/kirov/documents/privacy-policy
                </a>
                .
              </p>
              <p className="h5">
                Данная страница создана исключительно в целях декорации проекта
                и не является официальным источником.
              </p>
            </div>
          </div>
        </div>
        <div className="row">
          <div className="col-md-12">
            <div className="card">
              <p className="card-header h2">
                Политика конфиденциальности Магазина
              </p>
              <div className="card-body">
                <p className="card-title h6">
                  Настоящая Политика конфиденциальности персональных данных
                  (далее – Политика конфиденциальности) действует в отношении
                  всей информации, которую Сайт может получить о Пользователе во
                  время просмотра сайта.
                </p>
                <span className="card-text small">
                  <br />
                  <p className="h6">1. Определение терминов</p>
                  - "Магазин" – юридическое лицо или индивидуальный
                  предприниматель, осуществляющее(ий) приготовление и/или
                  реализацию Товара Пользователям Сервиса при оформлении ими
                  Заказа, а также осуществляющее(ий) Доставку Товара
                  Пользователям Сервиса в случае, когда соответствующая
                  возможность предусмотрена на Сервисе. Является оператором
                  обработки персональных данных. <br /> <br />
                  - "Персональные данные" — любая информация, относящаяся к
                  прямо или косвенно определенному или определяемому физическому
                  лицу (субъекту персональных данных). <br /> <br />
                  - "Обработка персональных данных" — любое действие (операция)
                  или совокупность действий (операций), совершаемых с
                  использованием средств автоматизации или без использования
                  таких средств с персональными данными, включая сбор, запись,
                  систематизацию, накопление, хранение, уточнение (обновление,
                  изменение), извлечение, использование, передачу
                  (распространение, предоставление, доступ), обезличивание,
                  блокирование, удаление, уничтожение персональных данных.
                  <br /> <br />
                  - "Конфиденциальность персональных данных" — обязательное для
                  соблюдения Оператором или иным получившим доступ к
                  персональным данным лицом требование не допускать их
                  распространения без согласия субъекта персональных данных или
                  наличия иного законного основания. <br /> <br />-
                  "Пользователь сайта" (далее - Пользователь) – лицо, имеющее
                  доступ к Сайту, посредством сети Интернет и использующее Сайт.{" "}
                  <br /> <br />
                  <p className="h6">2. Общие положения</p>
                  - Использование Пользователем Сайта означает согласие с
                  настоящей Политикой конфиденциальности и условиями обработки
                  персональных данных Пользователя.
                  <br /> <br />
                  - В случае несогласия с условиями Политики конфиденциальности
                  Пользователь должен прекратить использование Сайта. <br />{" "}
                  <br />
                  - Настоящая Политика конфиденциальности применяется только к
                  данному сайту. Магазин не контролирует и не несет
                  ответственность за сайты третьих лиц, на которые Пользователь
                  может перейти по ссылкам, доступным на Сайте. <br /> <br />
                  - Магазин не проверяет достоверность персональных данных,
                  предоставляемых Пользователем Сайта.
                  <br /> <br />
                  <p className="h6">3. Способы и сроки обработки персональной информации</p>
                  - Обработка персональных данных Пользователя осуществляется
                  без ограничения срока, любым законным способом, в том числе в
                  информационных системах персональных данных с использованием
                  средств автоматизации или без использования таких средств.
                  <br /> <br />
                  - Пользователь соглашается с тем, что Магазин вправе
                  передавать персональные данные третьим лицам исключительно в
                  целях выполнения заказа Пользователя, оформленного на Сайте,
                  включая доставку Товара, оказания Услуг или выполнения Работ.
                  <br /> <br />
                  - Персональные данные Пользователя могут быть переданы
                  уполномоченным органам государственной власти Российской
                  Федерации только по основаниям и в порядке, установленным
                  законодательством Российской Федерации. <br /> <br />
                  - При утрате или разглашении персональных данных Магазин
                  информирует Пользователя об утрате или разглашении
                  персональных данных.
                  <br /> <br />
                  - Магазин принимает необходимые организационные и технические
                  меры для защиты персональной информации Пользователя от
                  неправомерного или случайного доступа, уничтожения, изменения,
                  блокирования, копирования, распространения, а также от иных
                  неправомерных действий третьих лиц.
                  <br /> <br />
                  - Магазин совместно с Пользователем принимает все необходимые
                  меры по предотвращению убытков или иных отрицательных
                  последствий, вызванных утратой или разглашением персональных
                  данных Пользователя.
                  <br /> <br />
                  <p className="h6">4. Дополнительыне условия</p>
                  - Магазин вправе вносить изменения в настоящую Политику
                  конфиденциальности без согласия Пользователя.
                  <br /> <br />
                  - Новая Политика конфиденциальности вступает в силу с момента
                  ее размещения на Сайте, если иное не предусмотрено новой
                  редакцией Политики конфиденциальности.
                  <br />{" "}
                </span>
              </div>
            </div>
          </div>
        </div>
      </div>
    </main>
  );
};
